# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, Light_HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, Light_HGBlock, [96, 512, 3, 3]]   # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P3/16
  - [-1, 6, Light_HGBlock, [192, 1024, 5, 3, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]]
  - [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, Light_HGBlock, [384, 2048, 5, 3, False]]  # stage 4
  - [-1, 1, SPPF, [1024, 5]]  # 10
  - [-1, 2, CBAM, [1024]] # 11

# YOLO11n head
head:
  - [1, 1, Conv, [256]]  #12-P2/4
  - [3, 1, Conv, [256]]  # 13-P3/8
  - [7, 1, Conv, [512]]  # 14-P4/16
  - [11, 1, Conv, [512]]  # 15-P5/32
  - [[12, 13], 1, FreqFusion, []] # 16
  - [[14, 15], 1, FreqFusion, []] # 17
  - [16, 1, Conv, [512,3,2]]  # 18
  - [17, 1, Conv, [1024,3,2]]  # 19

  - [[1, 18, 7, 19], 1, AFPN4Head, [nc, 64]] # Detect(P3, P4, P5)
